//=============================================================================
//
// 何らかのボタン入力 [button_any.h]
// Author : 二階堂汰一
//
//=============================================================================
#ifndef _BUTTON_ANY_H_
#define _BUTTON_ANY_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "button.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 前方宣言
//*****************************************************************************

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CAnyButton :public CButton
{
public:
	CAnyButton();
	~CAnyButton();
	static HRESULT TextureLoad(void);
	static void TextureUnload(void);
	static CAnyButton * Create(void);
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);
private:
	void Input(void);
	void Press(void);
	static LPDIRECT3DTEXTURE9 m_pTexture;	//テクスチャのポインタ
	int nCountButton;						//ボタンのカウント
};
#endif