//=============================================================================
//
// リトライボタン [button_retry.cpp]
// Author : 二階堂汰一
//
//=============================================================================

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "Base/main.h"
#include "Base/manager.h"
#include "Base/renderer.h"
#include "Base/sound.h"
#include "button_retry.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define TEXTURE_PASS ("Data/Texture/Button/Button_Retry.png")	//テクスチャのパス

//*****************************************************************************
// 静的メンバ変数の初期化
//*****************************************************************************
LPDIRECT3DTEXTURE9 CRetryButton::m_pTexture;		//テクスチャのポインタ

//=============================================================================
// コンストラクタ
//=============================================================================
CRetryButton::CRetryButton()
{
}

//=============================================================================
// デストラクタ
//=============================================================================
CRetryButton::~CRetryButton()
{
}

//=============================================================================
// テクスチャ読み込み関数
//=============================================================================
HRESULT CRetryButton::TextureLoad(void)
{
	//レンダラーの取得
	CRenderer *pRenderer = CManager::GetRenderer();
	//デバイスの取得
	LPDIRECT3DDEVICE9 pDevice = pRenderer->GetDevice();
	//テクスチャの生成
	D3DXCreateTextureFromFile(pDevice,	//デバイスへのポインタ
		TEXTURE_PASS,					//ファイルの名前
		&m_pTexture);					//読み込むメモリー
	return S_OK;
}

//=============================================================================
// テクスチャ破棄関数
//=============================================================================
void CRetryButton::TextureUnload(void)
{
	//もしテクスチャのポインタがnullptrではない場合
	if (m_pTexture != nullptr)
	{
		//テクスチャの破棄処理関数呼び出し
		m_pTexture->Release();
		//テクスチャをnullptrにする
		m_pTexture = nullptr;
	}
}

//=============================================================================
// 生成処理関数呼び出し
//=============================================================================
CRetryButton * CRetryButton::Create(D3DXVECTOR3 Position)
{
	//リトライボタンのポインタ
	CRetryButton * pRetryButton = NULL;
	//リトライボタンのポインタがnullptrの場合
	if (pRetryButton == nullptr)
	{
		//リトライボタンのメモリ確保
		pRetryButton = new CRetryButton;
		//リトライボタンのポインタがnullptrではない場合
		if (pRetryButton != nullptr)
		{
			//リトライボタンの位置を設定する
			pRetryButton->SetPosition(Position);
			//リトライボタンの初期化処理関数呼び出し
			pRetryButton->Init();
		}
	}
	//リトライボタンのポインタを返す
	return pRetryButton;
}

//=============================================================================
// 初期化処理関数
//=============================================================================
HRESULT CRetryButton::Init(void)
{
	//テクスチャのUV座標の設定
	D3DXVECTOR2 aTexture[NUM_VERTEX];
	aTexture[0] = D3DXVECTOR2(0.0f, 0.0f);
	aTexture[1] = D3DXVECTOR2(1.0f, 0.0f);
	aTexture[2] = D3DXVECTOR2(0.0f, 1.0f);
	aTexture[3] = D3DXVECTOR2(1.0f, 1.0f);
	//ボタンの初期化処理関数呼び出し
	CButton::Init();
	//テクスチャの設定
	SetTexture(aTexture);
	//テクスチャの割り当て
	BindTexture(m_pTexture);
	return S_OK;
}

//=============================================================================
// 終了処理関数
//=============================================================================
void CRetryButton::Uninit(void)
{
	//ボタンの終了処理関数呼び出し
	CButton::Uninit();
}

//=============================================================================
// 更新処理関数
//=============================================================================
void CRetryButton::Update(void)
{
	//ボタンの更新処理関数呼び出し
	CButton::Update();
}

//=============================================================================
// 描画処理関数
//=============================================================================
void CRetryButton::Draw(void)
{
	//ボタンの描画処理関数呼び出し
	CButton::Draw();
}

//=============================================================================
// プレス処理関数
//=============================================================================
void CRetryButton::Press(void)
{
	//押したときのサウンド再生
	PlayButtonSE(CButton::BUTTON_SE_PUSH);
	//ゲームモードに遷移する
	CManager::StartFade(CManager::MODE_GAME);
}