//=============================================================================
//
// ゲームに戻るボタン [button_quit_game.h]
// Author : 二階堂汰一
//
//=============================================================================
#ifndef _BUTTON_QUIT_GAME_H_
#define _BUTTON_QUIT_GAME_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "button.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 前方宣言
//*****************************************************************************

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CQuitGameButton :public CButton
{
public:
	CQuitGameButton();
	~CQuitGameButton();
	static HRESULT TextureLoad(void);
	static void TextureUnload(void);
	static CQuitGameButton * Create(D3DXVECTOR3 Position);
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);
	void Press(void);
private:
	static LPDIRECT3DTEXTURE9 m_pTexture;	//テクスチャのポインタ
};
#endif