//=============================================================================
//
// 爆弾の爆発 [explosion_bomb.h]
// Author : 二階堂汰一
//
//=============================================================================
#ifndef _EXPLOSION_BOMB_H_
#define _EXPLOSION_BOMB_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "explosion.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 前方宣言
//*****************************************************************************

//*****************************************************************************
// 構造体定義
//*****************************************************************************

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CExplosionBomb :public CExplosion
{
public:
	CExplosionBomb();
	~CExplosionBomb();
	static HRESULT TextureLoad(void);
	static void TextureUnload(void);
	static CExplosionBomb * Create(D3DXVECTOR3 Position);
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);
private:
	void Animation(void);
	void Collision(void);
	static LPDIRECT3DTEXTURE9 m_pTexture;	//テクスチャへのポインタ
	int m_nCounterAnime;					//アニメカウンタ
	int m_nPatternAnime;					//アニメパターン
};
#endif


