//=============================================================================
//
// レベルアップアイテム [item_levelup.cpp]
// Author : 二階堂汰一
//
//=============================================================================

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "main.h"
#include "manager.h"
#include "renderer.h"
#include "scene2d.h"
#include "mode_game.h"
#include "player.h"
#include "item_levelup.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define TEXTURE ("Data/Texture/Item/lvup.png")	//テクスチャ
#define SIZE (D3DXVECTOR3(30.0f,30.0f,0.0f))	//サイズ

//*****************************************************************************
// 静的メンバ変数の初期化
//*****************************************************************************
LPDIRECT3DTEXTURE9 CItemLevelUP::m_pTexture = NULL;	//テクスチャへのポインタ

//=============================================================================
// コンストラクタ
//=============================================================================
CItemLevelUP::CItemLevelUP()
{
}

//=============================================================================
// デストラクタ
//=============================================================================
CItemLevelUP::~CItemLevelUP()
{
}

//=============================================================================
// テクスチャ読み込み関数
//=============================================================================
HRESULT CItemLevelUP::TextureLoad(void)
{
	//レンダラーの取得
	CRenderer *pRenderer = CManager::GetRenderer();
	//デバイスの取得
	LPDIRECT3DDEVICE9 pDevice = pRenderer->GetDevice();
	// テクスチャの生成
	D3DXCreateTextureFromFile(pDevice,	// デバイスへのポインタ
		TEXTURE,						// ファイルの名前
		&m_pTexture);					// 読み込むメモリー
	return S_OK;
}

//=============================================================================
// テクスチャ破棄関数
//=============================================================================
void CItemLevelUP::TextureUnload(void)
{
	//もしテクスチャがNULLじゃない場合
	if (m_pTexture != NULL)
	{
		//テクスチャの破棄処理関数呼び出し
		m_pTexture->Release();
		//テクスチャをNULLにする
		m_pTexture = NULL;
	}
}

//=============================================================================
// 生成処理関数
//=============================================================================
CItemLevelUP * CItemLevelUP::Create(D3DXVECTOR3 Position)
{
	//レベルアップアイテムのポインタ
	CItemLevelUP * pItemLevelUP = NULL;
	//もしレベルアップアイテムがNULLの場合
	if (pItemLevelUP == NULL)
	{
		//レベルアップアイテムのメモリ確保
		pItemLevelUP = new CItemLevelUP;
	}
	//もしレベルアップアイテムがNULLじゃない場合
	if (pItemLevelUP != NULL)
	{
		//位置を設定する
		pItemLevelUP->SetPosition(Position);
		//初期化処理関数呼び出し
		pItemLevelUP->Init();
	}
	return pItemLevelUP;
}

//=============================================================================
// 初期化処理関数
//=============================================================================
HRESULT CItemLevelUP::Init(void)
{
	//テクスチャのUV座標の設定
	D3DXVECTOR2 aTexture[NUM_VERTEX];
	aTexture[0] = D3DXVECTOR2(0.0f, 0.0f);
	aTexture[1] = D3DXVECTOR2(1.0f, 0.0f);
	aTexture[2] = D3DXVECTOR2(0.0f, 1.0f);
	aTexture[3] = D3DXVECTOR2(1.0f, 1.0f);
	//アイテムの初期化処理関数呼び出し
	CItem::Init();
	//サイズの初期設定
	SetSize(SIZE);
	//テクスチャの設定
	SetTexture(aTexture);
	//テクスチャの割り当て
	BindTexture(m_pTexture);
	return S_OK;
}

//=============================================================================
// 終了処理関数
//=============================================================================
void CItemLevelUP::Uninit(void)
{
	//アイテムの終了処理関数呼び出し
	CItem::Uninit();
}

//=============================================================================
// 更新処理関数
//=============================================================================
void CItemLevelUP::Update(void)
{
	//アイテムの更新処理関数呼び出し
	CItem::Update();
	//もし衝突判定が真のとき
	if (GetbCollision() == true)
	{
		//効果を与える処理関数呼び出し
		Give();
	}
}

//=============================================================================
// 描画処理関数
//=============================================================================
void CItemLevelUP::Draw(void)
{
	//アイテムの描画処理関数呼び出し
	CItem::Draw();
}

//=============================================================================
// 効果を与える処理関数関数
//=============================================================================
void CItemLevelUP::Give(void)
{
	//プレイヤーの取得
	CPlayer * pPlayer = CGameMode::GetPlayer();
	//プレイヤーがNULLじゃない場合
	if (pPlayer != NULL)
	{
		//レベルアップ処理関数の呼び出し
		pPlayer->LevelUp();
	}
	//終了処理関数呼び出し
	Uninit();
	return;
}
