//=============================================================================
//
// 体力のUI [ui_life.cpp]
// Author : 二階堂汰一
//
//=============================================================================

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include <cmath>
#include "main.h"
#include "manager.h"
#include "mode_game.h"
#include "ui_life_texture.h"
#include "ui_life.h"
#include "player.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define POSITION (D3DXVECTOR3(450.0f,30.0f,0.0f))	//位置
#define SIZE (D3DXVECTOR3(45.0f,45.0f,0.0f))		//サイズ
#define SHOW_ALPHA (255)							//アルファ値
#define HIDE_ALPHA (0)								//アルファ値

//*****************************************************************************
// 静的メンバ変数の初期化
//*****************************************************************************

//=============================================================================
// コンストラクタ
//=============================================================================
CLifeUI::CLifeUI(int nPriority) : CScene(nPriority)
{
	memset(m_apLifeTexture, 0, sizeof(m_apLifeTexture));	//UI用数字テクスチャへのポインタ
}

//=============================================================================
//デストラクタ
//=============================================================================
CLifeUI::~CLifeUI()
{
}

//=============================================================================
// 生成
//=============================================================================
CLifeUI * CLifeUI::Create(void)
{
	//体力のUIのポインタ
	CLifeUI * pLifeUI = NULL;
	//もし体力のUIのポインタがNULLの場合
	if (pLifeUI == NULL)
	{
		//体力のUIのメモリ確保
		pLifeUI = new CLifeUI;
	}
	//もし体力のUIのポインタがNULLじゃない場合
	if (pLifeUI != NULL)
	{
		//初期化処理関数呼び出し
		pLifeUI->Init();
	}
	//体力のUIのポインタを返す
	return pLifeUI;
}

//=============================================================================
// 初期化関数
//=============================================================================
HRESULT CLifeUI::Init(void)
{
	//プレイヤーの最大体力分回す
	for (int nCount = 0; nCount < PLAYER_MAX_LIFE; nCount++)
	{
		//体力のテクスチャ生成
		m_apLifeTexture[nCount] = CUILifeTexture::Create(D3DXVECTOR3(POSITION.x + (SIZE.x * nCount), POSITION.y, 0.0f), SIZE);
	}
	return S_OK;
}

//=============================================================================
// 終了関数
//=============================================================================
void CLifeUI::Uninit(void)
{
	//破棄処理関数呼び出し
	Release();
}

//=============================================================================
// 更新関数
//=============================================================================
void CLifeUI::Update(void)
{
}

//=============================================================================
// 描画関数
//=============================================================================
void CLifeUI::Draw(void)
{
	//プレイヤーの最大体力分回す
	for (int nCount = 0; nCount < PLAYER_MAX_LIFE; nCount++)
	{
		//描画処理関数呼び出し
		m_apLifeTexture[nCount]->Draw();
	}
}

//=============================================================================
// セット関数
//=============================================================================
void CLifeUI::SetLife(int nLife)
{
	//もし自機のUIが最大数以下だった時
	if (nLife <= PLAYER_MAX_LIFE)
	{
		//プレイヤーの最大体力分回す
		for (int nCount = 0; nCount < PLAYER_MAX_LIFE; nCount++)
		{
			m_apLifeTexture[nCount]->SetLifeTexture(HIDE_ALPHA);
		}
		//プレイヤーの体力分回す
		for (int nCount = 0; nCount < nLife; nCount++)
		{
			m_apLifeTexture[nCount]->SetLifeTexture(SHOW_ALPHA);
		}

	}
}
