//=============================================================================
//
// UI用体力のテクスチャ処理 [ui_life_texture.h]
// Author : 二階堂汰一
//
//=============================================================================
#ifndef _UI_LIFE_TEXTURE_H_
#define _UI_LIFE_TEXTURE_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 前方宣言
//*****************************************************************************

//*****************************************************************************
// 構造体定義
//*****************************************************************************

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CUILifeTexture
{
public:
	CUILifeTexture();
	~CUILifeTexture();
	static HRESULT TextureLoad(void);
	static void TextureUnload(void);
	static CUILifeTexture * Create(D3DXVECTOR3 Position,D3DXVECTOR3 Size);
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);
	void SetLifeTexture(int nAlpha);
	void SetPosition(D3DXVECTOR3 Position);
	void SetSize(D3DXVECTOR3 Size);
private:
	static LPDIRECT3DTEXTURE9 m_pTexture;	//テクスチャへのポインタ
	LPDIRECT3DVERTEXBUFFER9 m_pVtxBuff;		//バッファ
	D3DXVECTOR3 m_Position;					//位置
	D3DXVECTOR3 m_Size;						//サイズ
	int m_nPatternAnim;						//アニメパターン
};
#endif