//=============================================================================
//
// コンティニュー画面 [continue.cpp]
// Author : 二階堂汰一
//
//=============================================================================

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "Base/main.h"
#include "Base/manager.h"
#include "mode_game.h"
#include "Base/sound.h"
#include "Input/keyboard.h"
#include "Input/joystick.h"
#include "continue.h"
#include "2DPolygon/continue_logo.h"
#include "Button/continue_button_manager.h"
#include "Background/bg_continue.h"
#include "Character/player.h"
#include "Character/enemy.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 静的メンバ変数の初期化
//*****************************************************************************

//=============================================================================
// コンストラクタ
//=============================================================================
CContinue::CContinue()
{
	m_pContinueBG = NULL;
	m_pContinueLogo = NULL;
	m_pContinueButtonManager = NULL;
}

//=============================================================================
// デストラクタ
//=============================================================================
CContinue::~CContinue()
{
}

//=============================================================================
// 生成処理関数
//=============================================================================
CContinue * CContinue::Create()
{
	//コンティニュー画面のポインタ
	CContinue * pContinue = NULL;
	//もしコンティニュー画面がNULLの場合
	if (pContinue == NULL)
	{
		//コンティニュー画面のメモリ確保
		pContinue = new CContinue;
		//もしコンティニュー画面がNULLじゃない場合
		if (pContinue != NULL)
		{
			//初期化処理関数呼び出し
			pContinue->Init();
		}
	}
	//コンティニュー画面のポインタ
	return pContinue;
}

//=============================================================================
// 初期化処理関数
//=============================================================================
HRESULT CContinue::Init(void)
{
	//敵の取得
	CEnemy *  pEnemy = CGameMode::GetEnemy();
	//もし敵のポインタがNULLじゃない場合
	if (pEnemy != NULL)
	{
		//敵を停止させる
		pEnemy->SetbStop(true);
	}
	//全生成処理関数呼び出し
	CreateAll();
	return S_OK;
}

//=============================================================================
// 終了処理関数
//=============================================================================
void CContinue::Uninit(void)
{
	m_pContinueBG->Uninit();
	m_pContinueLogo->Uninit();
	m_pContinueButtonManager->Uninit();
	//破棄処理関数呼び出し
	Release();
}

//=============================================================================
// 更新処理関数
//=============================================================================
void CContinue::Update(void)
{
}

//=============================================================================
// 描画処理関数
//=============================================================================
void CContinue::Draw(void)
{
}

//=============================================================================
// 全生成処理関数
//=============================================================================
void CContinue::CreateAll(void)
{
	m_pContinueBG = CContinueBG::Create();
	m_pContinueLogo = CContinueLogo::Create();
	m_pContinueButtonManager = CContinueButtonManager::Create();
}
