//=============================================================================
//
// コンティニュー画面 [continue.h]
// Author : 二階堂汰一
//
//=============================================================================
#ifndef _CONTINUE_H_
#define _CONTINUE_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "Base/scene.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CContinueBG;
class CContinueLogo;
class CContinueButtonManager;

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CContinue : CScene
{
public:
	CContinue();
	~CContinue();
	static CContinue * Create();
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);
private:
	void CreateAll(void);
	CContinueBG * m_pContinueBG;
	CContinueLogo * m_pContinueLogo;
	CContinueButtonManager * m_pContinueButtonManager;
};
#endif
