//=============================================================================
//
// ツールモード [mode_tool.cpp]
// Author : 二階堂汰一
//
//=============================================================================

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "main.h"
#include "renderer.h"
#include "manager.h"
#include "mode_tool.h"
#include "camera.h"
#include "tool.h"
#include "particle.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 静的メンバ変数の初期化
//*****************************************************************************
CCamera * CToolMode::m_pCamera = NULL;	//カメラのポインタ
CTool * CToolMode::m_pTool = NULL;	//ツールのポインタ

//=============================================================================
// コンストラクタ
//=============================================================================
CToolMode::CToolMode()
{
}

//=============================================================================
// デストラクタ
//=============================================================================
CToolMode::~CToolMode()
{
}

//=============================================================================
// 生成処理関数
//=============================================================================
CToolMode * CToolMode::Create()
{
	//ツールモードのポインタ
	CToolMode * pToolMode = NULL;
	//もしツールモードがNULLの場合
	if (pToolMode == NULL)
	{
		//ツールモードのメモリ確保
		pToolMode = new CToolMode;
		//もしツールモードがNULLじゃない場合
		if (pToolMode != NULL)
		{
			//ツールモードの初期化処理関数呼び出し
			pToolMode->Init();
		}
	}
	//ツールモードのポインタ
	return pToolMode;
}

//=============================================================================
// 初期化処理関数
//=============================================================================
HRESULT CToolMode::Init(void)
{
	InitCreateAll();
	//もしツールのポインタがNULLの場合
	if (m_pTool == NULL)
	{
		m_pTool = new CTool;
	}
	m_pTool->Init();
	return S_OK;
}

//=============================================================================
// 終了処理関数
//=============================================================================
void CToolMode::Uninit(void)
{
	//もしカメラのポインタがNULLじゃない場合
	if (m_pCamera != NULL)
	{
		//カメラの初期化処理関数呼び出し
		m_pCamera->Uninit();
		//カメラのメモリ破棄
		delete m_pCamera;
		//カメラのポインタをNULLにする
		m_pCamera = NULL;
	}
	//もしツールのポインタがNULLじゃない場合
	if (m_pTool != NULL)
	{
		//ツールの終了処理関数呼び出し
		m_pTool->Uninit();
		//ツールのメモリ破棄
		delete m_pTool;
		//ツールのポインタをNULLにする
		m_pTool = NULL;
	}
}

//=============================================================================
// 更新処理関数
//=============================================================================
void CToolMode::Update(void)
{
	//もしカメラのポインタがNULLじゃない場合
	if (m_pCamera != NULL)
	{
		//カメラを設定する
		m_pCamera->SetCamera();
		//カメラの更新処理関数呼び出し
		m_pCamera->Update();
	}
	m_pTool->Update();
}

//=============================================================================
// 描画処理関数
//=============================================================================
void CToolMode::Draw(void)
{
	m_pTool->Draw();
}

void CToolMode::InitCreateAll(void)
{
	//もしカメラのポインタがNULLの場合
	if (m_pCamera == NULL)
	{
		//カメラのメモリ確保
		m_pCamera = new CCamera;
	}
	//もしカメラのポインタがNULLじゃない場合
	if (m_pCamera != NULL)
	{
		//カメラの初期化処理関数呼び出し
		m_pCamera->Init();
	}
}
