//=============================================================================
//
// ツールモード [mode_tool.h]
// Author : 二階堂汰一
//
//=============================================================================
#ifndef _MODE_TOOL_H_
#define _MODE_TOOL_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "scene.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CCamera;
class CTool;

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CToolMode : CScene
{
public:
	CToolMode();
	~CToolMode();
	static CToolMode * Create();
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);
	static CTool * GetTool(void) { return m_pTool; }
private:
	void InitCreateAll(void);
	static CTool * m_pTool;		//ツールのポインタ
	bool m_bWindow;				//ウィンドウを使用しているか
	static CCamera * m_pCamera;		//カメラのポインタ
};
#endif
