//=============================================================================
//
// パーティクル [particle.h]
// Author : 二階堂汰一
//
//=============================================================================
#ifndef _PARTICLE_H_
#define _PARTICLE_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "billboard.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 前方宣言
//*****************************************************************************

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CParticle :public CBillboard
{
public:
	CParticle();
	~CParticle();
	static HRESULT TextureLoad(void);
	static void TextureUnload(void);
	static CParticle * Create(void);
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);
private:
	static LPDIRECT3DTEXTURE9 m_pTexture;	//テクスチャのポインタ
	D3DXVECTOR3 m_Move;						//移動量
	int m_nLife;							//体力
	float m_fAngle;							//角度
	bool m_bLife;							//体力の使用状態
};
#endif