//=============================================================================
//
// 目玉(ハード) [enemy_eye_hard.h]
// Author : 二階堂汰一
//
//=============================================================================
#ifndef _ENEMY_EYE_HARD_H_
#define _ENEMY_EYE_HARD_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "enemy.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 前方宣言
//*****************************************************************************

//*****************************************************************************
// 構造体定義
//*****************************************************************************

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CEnemyEyeHard :public CEnemy
{
public:
	CEnemyEyeHard();
	~CEnemyEyeHard();
	static HRESULT TextureLoad(void);
	static void TextureUnload(void);
	static CEnemyEyeHard * Create(D3DXVECTOR3 Position);
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);
private:
	void Attack(void);
	void Death(void);
	void Gaze(void);
	void Stop(void);
	void Stay(void);
	static LPDIRECT3DTEXTURE9 m_pTexture;	//テクスチャへのポインタ
	D3DXVECTOR3 m_StopPosition;				//停止位置
	float m_fTargetAngle;					//目標までの角度
	int m_nShotTime;						//弾を発射するまでの時間
	int m_nStayTime;						//滞在時間
};
#endif