//=============================================================================
//
// 爆弾の敵の胴体 [enemy_bomb_body.h]
// Author : 二階堂汰一
//
//=============================================================================
#ifndef _ENEMY_BOMB_BODY_H_
#define _ENEMY_BOMB_BODY_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "enemy.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CEnemyBombHead;
//*****************************************************************************
// 構造体定義
//*****************************************************************************

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CEnemyBombBody :public CEnemy
{
public:
	CEnemyBombBody(int nPriority = 1);
	~CEnemyBombBody();
	static HRESULT TextureLoad(void);
	static void TextureUnload(void);
	static CEnemyBombBody * Create(D3DXVECTOR3 Position, CEnemyBombHead * pHead);
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);
	void Death(void);
private:
	void Move(void);
	CEnemyBombHead * m_pBombHead;			//爆弾の敵の頭のポインタ
	static LPDIRECT3DTEXTURE9 m_pTexture;	//テクスチャへのポインタ
	float m_fRadian;						//ラジアン
	float m_fAddRadian;						//ラジアンの加算量
	bool m_bDeath;							//死んだかどうか
};
#endif