//=============================================================================
//
// 敵 [enemy.cpp]
// Author : 二階堂汰一
//
//=============================================================================

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "Base/main.h"
#include "Base/manager.h"
#include "Mode/mode_game.h"
#include "Base/renderer.h"
#include "enemy.h"
#include "Player/player.h"
#include "Bullet/bullet.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define SCORE (100)
#define MINIMUM_LFE (0)
#define MINIMUM_COLOR_CHANGE_TIME (0)
#define COLOR_CHANGE_TIME (10)
#define DEFAULT_COLOR (D3DXCOLOR(1.0f, 1.0f, 1.0f, 1.0f))
#define HIT_COLOR (D3DXCOLOR(1.0f, 0.0f, 0.0f, 1.0f))

//*****************************************************************************
// 静的メンバ変数の初期化
//*****************************************************************************

//=============================================================================
// コンストラクタ
//=============================================================================
CEnemy::CEnemy(int nPriority) : CScene2d(nPriority)
{
	m_Move = INITIAL_D3DXVECTOR3;						//移動量
	m_nLife = MINIMUM_LFE;								//体力
	m_nChangeColorTime = MINIMUM_COLOR_CHANGE_TIME;		//色変更時間
	m_bHit = false;										//ヒットしたか
	m_State = STATE_NONE;								//状態
}

//=============================================================================
// デストラクタ
//=============================================================================
CEnemy::~CEnemy()
{
}

//=============================================================================
// 初期化処理関数
//=============================================================================
HRESULT CEnemy::Init(void)
{
	//2Dシーン管理初期化処理関数呼び出し
	CScene2d::Init();
	//オブジェタイプを敵にする
	SetObjectType(CScene::OBJECT_TYPE_ENEMY);
	return S_OK;
}

//=============================================================================
// 終了処理関数
//=============================================================================
void CEnemy::Uninit(void)
{
	//2Dシーン管理終了処理関数呼び出し
	CScene2d::Uninit();
}

//=============================================================================
// 更新処理関数
//=============================================================================
void CEnemy::Update(void)
{
	//位置を取得する
	D3DXVECTOR3 Position = GetPosition();
	//2Dシーン管理更新処理関数呼び出し
	CScene2d::Update();
	//位置更新
	Position += m_Move;
	//位置の設定
	SetPosition(Position);
	//もしヒットしたら
	if (m_bHit == true)
	{
		//色変更時間を進める
		m_nChangeColorTime++;
		//もし色変更時間になったら
		if (m_nChangeColorTime == COLOR_CHANGE_TIME)
		{
			//色を設定する
 			SetColor(DEFAULT_COLOR);
			//ヒット状態を偽にする
			m_bHit = false;
			//色変更時間を初期化する
			m_nChangeColorTime = MINIMUM_COLOR_CHANGE_TIME;
		}
	}
}

//=============================================================================
// 描画処理関数
//=============================================================================
void CEnemy::Draw(void)
{
	//2Dシーン管理描画処理関数呼び出し
	CScene2d::Draw();
}

//=============================================================================
// ヒット処理関数
//=============================================================================
void CEnemy::Hit(void)
{
	//ヒット状態にする
	m_bHit = true;
	//プレイヤーを取得する
	CPlayer * pPlayer = CGameMode::GetPlayer();
	//もしプレイヤーのポインタがNULLじゃなかったら
	if (pPlayer != NULL)
	{
		//プレイヤーのスコアを加算する
		pPlayer->AddScore(SCORE);
	}
	//体力減算関数呼び出し
	SubLife();
	//色を設定する
	SetColor(HIT_COLOR);
}

//=============================================================================
// 体力減算処理関数
//=============================================================================
void CEnemy::SubLife(void)
{
	//体力を減算する
	m_nLife--;
}