//=============================================================================
//
// 上層背景 [background_upper_layer.h]
// Author : 二階堂汰一
//
//=============================================================================
#ifndef _BACKGROUND_UPPER_LAYER_H_
#define _BACKGROUND_UPPER_LAYER_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "background.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 前方宣言
//*****************************************************************************

//*****************************************************************************
// 構造体定義
//*****************************************************************************

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CBackgroundUpperLayer :public CBackground
{
public:
	CBackgroundUpperLayer(int nPriority = 1);
	~CBackgroundUpperLayer();
	static HRESULT TextureLoad(void);
	static void TextureUnload(void);
	static CBackgroundUpperLayer * Create(D3DXVECTOR3 Position);
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);
private:
	static LPDIRECT3DTEXTURE9 m_pTexture;	//テクスチャへのポインタ
};
#endif