//=============================================================================
//
// 火球 [bullet_fireball.h]
// Author : 二階堂汰一
//
//=============================================================================
#ifndef _BULLET_FIREBALL_H_
#define _BULLET_FIREBALL_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "bullet_enemy.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 前方宣言
//*****************************************************************************

//*****************************************************************************
// 構造体定義
//*****************************************************************************

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CBulletFireball :public CBulletEnemy
{
public:
	CBulletFireball(int nPriority = DEFAULT_PRIORITY);
	~CBulletFireball();
	static HRESULT TextureLoad(void);
	static void TextureUnload(void);
	static CBulletFireball * Create(D3DXVECTOR3 Position, D3DXVECTOR3 Speed, D3DXVECTOR3 Size);
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);
private:
	void Death(void);
	static LPDIRECT3DTEXTURE9 m_pTexture;	//テクスチャへのポインタ
};
#endif


