//=============================================================================
//
// 火球 [bullet_fireball.cpp]
// Author : 二階堂汰一
//
//=============================================================================

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include <stdio.h>
#include <stdlib.h>
#include "main.h"
#include "manager.h"
#include "renderer.h"
#include "scene2d.h"
#include "sound.h"
#include "bullet.h"
#include "bullet_fireball.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define TEXTURE ("Data/Texture/Player/BattleShip.png")
#define COLOR (D3DXCOLOR(0.0f,1.0f,0.0f,1.0f))
#define LIFE (75)

//*****************************************************************************
// 静的メンバ変数の初期化
//*****************************************************************************
LPDIRECT3DTEXTURE9 CBulletFireball::m_pTexture = NULL;	//テクスチャへのポインタ

//=============================================================================
// コンストラクタ
//=============================================================================
CBulletFireball::CBulletFireball(int nPriority)
{
}

//=============================================================================
// デストラクタ
//=============================================================================
CBulletFireball::~CBulletFireball()
{
}

//=============================================================================
// テクスチャ読み込み関数
//=============================================================================
HRESULT CBulletFireball::TextureLoad(void)
{
	CRenderer *pRenderer = CManager::GetRenderer();
	LPDIRECT3DDEVICE9 pDevice = pRenderer->GetDevice();

	// テクスチャの生成
	D3DXCreateTextureFromFile(pDevice,	// デバイスへのポインタ
		TEXTURE,						// ファイルの名前
		&m_pTexture);					// 読み込むメモリー
	return S_OK;
}

//=============================================================================
// テクスチャ破棄関数
//=============================================================================
void CBulletFireball::TextureUnload(void)
{
	// テクスチャの破棄
	if (m_pTexture != NULL)
	{
		m_pTexture->Release();
		m_pTexture = NULL;
	}
}

//=============================================================================
// 生成処理関数
//=============================================================================
CBulletFireball * CBulletFireball::Create(D3DXVECTOR3 Position, D3DXVECTOR3 Speed, D3DXVECTOR3 Size)
{
	CBulletFireball * pFireBall;
	pFireBall = new CBulletFireball;
	pFireBall->Init();
	pFireBall->SetPosition(Position);
	pFireBall->SetSize(Size);
	pFireBall->SetMove(Speed);
	return pFireBall;
}

//=============================================================================
// 初期化処理関数
//=============================================================================
HRESULT CBulletFireball::Init(void)
{
	//テクスチャのUV座標の設定
	D3DXVECTOR2 aTexture[NUM_VERTEX];
	aTexture[0] = D3DXVECTOR2(0.0f, 0.0f);
	aTexture[1] = D3DXVECTOR2(1.0f, 0.0f);
	aTexture[2] = D3DXVECTOR2(0.0f, 1.0f);
	aTexture[3] = D3DXVECTOR2(1.0f, 1.0f);
	//敵の弾の初期化処理関数呼び出し
	CBulletEnemy::Init();
	//色の初期設定
	SetColor(COLOR);
	//体力の初期設定
	SetLife(LIFE);
	//テクスチャの設定
	SetTexture(aTexture);
	//テクスチャの割り当て
	BindTexture(m_pTexture);
	return S_OK;
}

//=============================================================================
// 終了処理関数
//=============================================================================
void CBulletFireball::Uninit(void)
{
	//敵の弾の終了処理関数呼び出し
	CBulletEnemy::Uninit();
}

//=============================================================================
// 更新処理関数
//=============================================================================
void CBulletFireball::Update(void)
{
	//移動量の取得
	D3DXVECTOR3 Move = GetMove();
	//もしライフが0になったら
	if (GetLife() <= 0)
	{
		//死亡処理関数呼び出し
		Death();
	}
	//移動量を設定する
	SetMove(Move);
	//敵の弾の更新処理関数呼び出し
	CBulletEnemy::Update();
}

//=============================================================================
// 描画処理関数
//=============================================================================
void CBulletFireball::Draw(void)
{
	//敵の弾の描画処理関数呼び出し
	CBulletEnemy::Draw();
}

//=============================================================================
// 死亡処理関数
//=============================================================================
void CBulletFireball::Death(void)
{
	//爆発エフェクトの生成
	//
	//爆発サウンドの再生
	//
	//終了処理関数呼び出し
	Uninit();
	return;
}
