//=============================================================================
//
// n-way [bullet_n-way.cpp]
// Author : 二階堂汰一
//
//=============================================================================

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include <stdio.h>
#include <stdlib.h>
#include "main.h"
#include "manager.h"
#include "renderer.h"
#include "scene2d.h"
#include "bullet_n-way.h"
#include "bullet.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define TEXTURE ("Data/Texture/Enemy/bullet.png")
#define SIZE (D3DXVECTOR3(10.0f,10.0f,0.0f))
#define LIFE (300)

//*****************************************************************************
// 静的メンバ変数の初期化
//*****************************************************************************
LPDIRECT3DTEXTURE9 CBulletN_Way::m_pTexture = NULL;	//テクスチャへのポインタ

//=============================================================================
// コンストラクタ
//=============================================================================
CBulletN_Way::CBulletN_Way(int nPriority)
{
}

//=============================================================================
// デストラクタ
//=============================================================================
CBulletN_Way::~CBulletN_Way()
{
}

//=============================================================================
// テクスチャ読み込み関数
//=============================================================================
HRESULT CBulletN_Way::TextureLoad(void)
{
	CRenderer *pRenderer = CManager::GetRenderer();
	LPDIRECT3DDEVICE9 pDevice = pRenderer->GetDevice();

	// テクスチャの生成
	D3DXCreateTextureFromFile(pDevice,	// デバイスへのポインタ
		TEXTURE,						// ファイルの名前
		&m_pTexture);					// 読み込むメモリー
	return S_OK;
}

//=============================================================================
// テクスチャ破棄関数
//=============================================================================
void CBulletN_Way::TextureUnload(void)
{
	// テクスチャの破棄
	if (m_pTexture != NULL)
	{
		m_pTexture->Release();
		m_pTexture = NULL;
	}
}

//=============================================================================
// 生成処理関数
//=============================================================================
CBulletN_Way * CBulletN_Way::Create(D3DXVECTOR3 Position, D3DXVECTOR3 Speed)
{
	CBulletN_Way * pBulletN_Way;
	pBulletN_Way = new CBulletN_Way;
	pBulletN_Way->Init();
	pBulletN_Way->SetPosition(Position);
	pBulletN_Way->SetMove(Speed);
	return pBulletN_Way;
}

//=============================================================================
// 初期化処理関数
//=============================================================================
HRESULT CBulletN_Way::Init(void)
{
	//敵の初期化処理関数呼び出し
	CBulletEnemy::Init();
	//サイズの初期設定
	SetSize(SIZE);
	return S_OK;
}

//=============================================================================
// 終了処理関数
//=============================================================================
void CBulletN_Way::Uninit(void)
{
	//敵の終了処理関数呼び出し
	CBulletEnemy::Uninit();
}

//=============================================================================
// 更新処理関数
//=============================================================================
void CBulletN_Way::Update(void)
{
	//敵の更新処理関数呼び出し
	CBulletEnemy::Update();
}

//=============================================================================
// 描画処理関数
//=============================================================================
void CBulletN_Way::Draw(void)
{
	//敵の描画処理関数呼び出し
	CBulletEnemy::Draw();
}
