//=============================================================================
//
// ボタン [button.h]
// Author : 二階堂汰一
//
//=============================================================================
#ifndef _BUTTON_H_
#define _BUTTON_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "scene2d.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 前方宣言
//*****************************************************************************

//*****************************************************************************
// 構造体定義
//*****************************************************************************

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CButton : CScene2d
{
public:
	typedef enum
	{
		BUTTON_NONE = -1,
		BUTTON_PLAY,
		BUTTON_REPLAY,
		BUTTON_EXIT,
		BUTTON_MAX
	}BUTTON;
	CButton(int nPriority = 0);
	~CButton();
	static HRESULT TextureLoad(void);
	static void TextureUnload(void);
	static CButton * Create(D3DXVECTOR3 Positon,BUTTON Button);
	HRESULT Init(BUTTON Button);
	void Uninit(void);
	void Update(void);
	void Draw(void);
	void SelectButton(bool bSelect);
private:
	static LPDIRECT3DTEXTURE9 m_apTexture[BUTTON_MAX];
	BUTTON m_Button;
};
#endif