//=============================================================================
//
// 名前入力背景背景 [background_name.cpp]
// Author : 二階堂汰一
//
//=============================================================================

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "Base/main.h"
#include "Base/manager.h"
#include "Base/renderer.h"
#include "background_name.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define TEXTURE ("Data/Texture/Background/background_name.png")	//テクスチャ
#define SIZE (D3DXVECTOR3(1920.0f,1080.0f,0.0f))				//サイズ
#define FLAME (0)												//フレーム

//*****************************************************************************
// 静的メンバ変数の初期化
//*****************************************************************************
LPDIRECT3DTEXTURE9 CBackgroundName::m_pTexture = NULL;	//テクスチャへのポインタ

//=============================================================================
// コンストラクタ
//=============================================================================
CBackgroundName::CBackgroundName()
{
}

//=============================================================================
// デストラクタ
//=============================================================================
CBackgroundName::~CBackgroundName()
{
}

//=============================================================================
// テクスチャ読み込み関数
//=============================================================================
HRESULT CBackgroundName::TextureLoad(void)
{
	//レンダラーの取得
	CRenderer *pRenderer = CManager::GetRenderer();
	//デバイスの取得
	LPDIRECT3DDEVICE9 pDevice = pRenderer->GetDevice();
	// テクスチャの生成
	D3DXCreateTextureFromFile(pDevice,	// デバイスへのポインタ
		TEXTURE,						// ファイルの名前
		&m_pTexture);					// 読み込むメモリー
	return S_OK;
}

//=============================================================================
// テクスチャ破棄関数
//=============================================================================
void CBackgroundName::TextureUnload(void)
{
	//もしテクスチャがNULLではない場合
	if (m_pTexture != NULL)
	{
		//テクスチャの破棄処理関数呼び出し
		m_pTexture->Release();
		//テクスチャをNULLにする
		m_pTexture = NULL;
	}
}

//=============================================================================
// 生成処理関数
//=============================================================================
CBackgroundName * CBackgroundName::Create(D3DXVECTOR3 Position)
{
	//名前入力背景のポインタ
	CBackgroundName * pBackgroundName = NULL;
	//もし名前入力背景がNULLの場合
	if (pBackgroundName == NULL)
	{
		//名前入力背景のメモリ確保
		pBackgroundName = new CBackgroundName;
		//もし名前入力背景がNULLではない場合
		if (pBackgroundName != NULL)
		{
			//名前入力背景の初期化処理関数呼び出し
			pBackgroundName->Init();
			//名前入力背景の位置を設定する
			pBackgroundName->SetPosition(Position);
		}
	}
	//名前入力背景のポインタを返す
	return pBackgroundName;
}

//=============================================================================
// 初期化処理関数
//=============================================================================
HRESULT CBackgroundName::Init(void)
{
	//テクスチャのUV座標の設定
	D3DXVECTOR2 aTexture[NUM_VERTEX];
	aTexture[0] = D3DXVECTOR2(0.0f, 0.0f);
	aTexture[1] = D3DXVECTOR2(1.0f, 0.0f);
	aTexture[2] = D3DXVECTOR2(0.0f, 1.0f);
	aTexture[3] = D3DXVECTOR2(1.0f, 1.0f);
	//背景の初期化処理関数呼び出し
	CBackground::Init();
	//サイズの初期設定
	SetSize(SIZE);
	//フレームの初期設定
	SetFlame(FLAME);
	//テクスチャの設定
	SetTexture(aTexture);
	//テクスチャの割り当て
	BindTexture(m_pTexture);
	return S_OK;
}

//=============================================================================
// 終了処理関数
//=============================================================================
void CBackgroundName::Uninit(void)
{
	//背景の終了処理関数呼び出し
	CBackground::Uninit();
}

//=============================================================================
// 更新処理関数
//=============================================================================
void CBackgroundName::Update(void)
{
	//背景の更新処理関数呼び出し
	CBackground::Update();
}

//=============================================================================
// 描画処理関数
//=============================================================================
void CBackgroundName::Draw(void)
{
	//背景の描画処理関数呼び出し
	CBackground::Draw();
}
