//=============================================================================
//
// ゲームオーバー背景 [game_over_logo.h]
// Author : 二階堂汰一
//
//=============================================================================
#ifndef _GAME_OVER_BG_H_
#define _GAME_OVER_BG_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "Base/scene2d.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 前方宣言
//*****************************************************************************

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CGameOverBG :public CScene2d
{
public:
	CGameOverBG(int nPriority = PRIORITY_BG);
	~CGameOverBG();
	static CGameOverBG * Create(void);
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);
private:
	int m_nButtonCreateTime;	//ボタンマネージャーの生成タイミング
	int m_nButtonCreateCount;	//ボタンマネージャーの生成カウント
	float m_fAlpha;				//アルファ値
	float m_fAddAlpha;			//アルファ値の加算量
};
#endif