//=============================================================================
//
// ゲームクリアロゴ [game_clear_logo.h]
// Author : 二階堂汰一
//
//=============================================================================
#ifndef _GAME_CLEAR_LOGO_H_
#define _GAME_CLEAR_LOGO_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "Base/scene2d.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 前方宣言
//*****************************************************************************

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CGameClearLogo :public CScene2d
{
public:
	CGameClearLogo(int nPriority = PRIORITY_POLYGON2D);
	~CGameClearLogo();
	static HRESULT TextureLoad(void);
	static void TextureUnload(void);
	static CGameClearLogo * Create(void);
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);
private:
	static LPDIRECT3DTEXTURE9 m_pTexture;		//テクスチャへのポインタ
	int m_nDisplayTimeCount;					//表示時間のカウント
};
#endif