//=============================================================================
//
// ハートアイコン [heart_icon.cpp]
// Author : 二階堂汰一
//
//=============================================================================

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "Base/main.h"
#include "Base/manager.h"
#include "Base/renderer.h"
#include "heart_icon.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define SIZE (D3DXVECTOR3(SCREEN_WIDTH,SCREEN_HEIGHT,0.0f))		//サイズ
#define COLOR (D3DXCOLOR(0.0f,0.0f,0.0f,0.3f))					//色
#define TEXTURE_PASS ("Data/Texture/heart_icon.png")			//テクスチャパス

//*****************************************************************************
// 静的メンバ変数の初期化
//*****************************************************************************
LPDIRECT3DTEXTURE9 CHeartIcon::m_pTexture = nullptr;	//テクスチャのポインタ

//=============================================================================
// コンストラクタ
//=============================================================================
CHeartIcon::CHeartIcon(int nPriority) : CScene2d(nPriority)
{
}

//=============================================================================
// デストラクタ
//=============================================================================
CHeartIcon::~CHeartIcon()
{
}

//=============================================================================
// テクスチャ読み込み関数
//=============================================================================
HRESULT CHeartIcon::TextureLoad(void)
{
	//レンダラーの取得
	CRenderer *pRenderer = CManager::GetRenderer();
	//デバイスの取得
	LPDIRECT3DDEVICE9 pDevice = pRenderer->GetDevice();
	//テクスチャの生成
	D3DXCreateTextureFromFile(pDevice,	//デバイスへのポインタ
		TEXTURE_PASS,					//ファイルの名前
		&m_pTexture);					//読み込むメモリー
	return S_OK;
}

//=============================================================================
// テクスチャ破棄関数
//=============================================================================
void CHeartIcon::TextureUnload(void)
{
	//もしテクスチャのポインタがnullptrではない場合
	if (m_pTexture != nullptr)
	{
		//テクスチャの破棄処理関数呼び出し
		m_pTexture->Release();
		//テクスチャのポインタをnullptrにする
		m_pTexture = nullptr;
	}
}

//=============================================================================
// 生成処理関数呼び出し
//=============================================================================
CHeartIcon * CHeartIcon::Create(D3DXVECTOR3 Position)
{
	//ポーズ背景のポインタ
	CHeartIcon * pHeartIcon = nullptr;
	//ポーズ背景のポインタがnullptrの場合
	if (pHeartIcon == nullptr)
	{
		//ポーズ背景のメモリ確保
		pHeartIcon = new CHeartIcon;
		//ポーズ背景のポインタがnullptrではない場合
		if (pHeartIcon != nullptr)
		{
			//ポーズ背景の位置設定
			pHeartIcon->SetPosition(Position);
			//ポーズ背景のサイズ設定
			pHeartIcon->SetSize(SIZE);
			//ポーズ背景の色設定
			pHeartIcon->SetColor(COLOR);
			//ポーズ背景の初期化処理関数呼び出し
			pHeartIcon->Init();
		}
	}
	//ポーズ背景のポインタを返す
	return pHeartIcon;
}

//=============================================================================
// 初期化処理関数
//=============================================================================
HRESULT CHeartIcon::Init(void)
{
	//テクスチャのUV座標の設定
	D3DXVECTOR2 aTexture[NUM_VERTEX];
	aTexture[0] = D3DXVECTOR2(0.0f, 0.0f);
	aTexture[1] = D3DXVECTOR2(1.0f, 0.0f);
	aTexture[2] = D3DXVECTOR2(0.0f, 1.0f);
	aTexture[3] = D3DXVECTOR2(1.0f, 1.0f);
	//ボタンの初期化処理関数呼び出し
	CScene2d::Init();
	//テクスチャの設定
	SetTexture(aTexture);
	return S_OK;
}

//=============================================================================
// 終了処理関数
//=============================================================================
void CHeartIcon::Uninit(void)
{
	//ボタンの終了処理関数呼び出し
	CScene2d::Uninit();
}

//=============================================================================
// 更新処理関数
//=============================================================================
void CHeartIcon::Update(void)
{
	//ボタンの更新処理関数呼び出し
	CScene2d::Update();
}

//=============================================================================
// 描画処理関数
//=============================================================================
void CHeartIcon::Draw(void)
{
	//ボタンの描画処理関数呼び出し
	CScene2d::Draw();
}