//=============================================================================
//
// 文字 [letter.h]
// Author : 二階堂汰一
//
//=============================================================================
#ifndef _LETTER_H_
#define _LETTER_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 前方宣言
//*****************************************************************************

//*****************************************************************************
// 構造体定義
//*****************************************************************************

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CLetter
{
public:
	CLetter();
	~CLetter();
	static HRESULT TextureLoad(void);
	static void TextureUnload(void);
	static CLetter* Create(D3DXVECTOR3 Position);
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);
	void SelectColor(void);
	void NotSelectColor(void);
	void SetLetter(int nLetter);
	void SetPostion(D3DXVECTOR3 Position) { m_Position = Position; }
	void SetSize(D3DXVECTOR3 Size) { m_Size = Size; }
private:
	static LPDIRECT3DTEXTURE9 m_pTexture;	//テクスチャのポインタ
	LPDIRECT3DVERTEXBUFFER9 m_pVtxBuff;		//頂点バッファへのポインタ
	D3DXVECTOR3 m_Position;					//位置
	D3DXVECTOR3 m_Size;						//サイズ
	float m_fAlpha;							//透明度
};
#endif