//=============================================================================
//
// タイトルロゴ [title_logo.h]
// Author : 二階堂汰一
//
//=============================================================================
#ifndef _TITLE_LOGO_H_
#define _TITLE_LOGO_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "Base/scene2d.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 前方宣言
//*****************************************************************************

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CTitleLogo :public CScene2d
{
public:
	CTitleLogo(int nPriority = PRIORITY_POLYGON2D);
	~CTitleLogo();
	static HRESULT TextureLoad(void);
	static void TextureUnload(void);
	static CTitleLogo * Create(void);
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);
private:
	static LPDIRECT3DTEXTURE9 m_pTexture;	//テクスチャのポインタ
};
#endif