//=============================================================================
//
// 背景管理処理 [background_manager.cpp]
// Author : 二階堂汰一
//
//=============================================================================

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "background_manager.h"
#include "background_under_layer.h"
#include "background_middle_layer.h"
#include "background_upper_layer.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 静的メンバ変数の初期化
//*****************************************************************************

//=============================================================================
// コンストラクタ
//=============================================================================
CBackgroundManager::CBackgroundManager()
{
}

//=============================================================================
// デストラクタ
//=============================================================================
CBackgroundManager::~CBackgroundManager()
{
}

//=============================================================================
// 生成処理関数
//=============================================================================
CBackgroundManager * CBackgroundManager::Create()
{
	CBackgroundManager * pBackgroundManager;
	pBackgroundManager = new CBackgroundManager;
	pBackgroundManager->Init();
	return pBackgroundManager;
}

//=============================================================================
// 初期化処理関数
//=============================================================================
void CBackgroundManager::Init(void)
{
	//下層背景の生成
	CBackgroundUnderLayer::Create(D3DXVECTOR3(SCREEN_WIDTH / 2, SCREEN_HEIGHT / 2, 0.0f));
	//中層背景の生成
	CBackgroundMiddleLayer::Create(D3DXVECTOR3(SCREEN_WIDTH / 2, SCREEN_HEIGHT / 2, 0.0f));
	//上層背景の生成
	CBackgroundUpperLayer::Create(D3DXVECTOR3(SCREEN_WIDTH / 2, SCREEN_HEIGHT / 2, 0.0f));
}
