//=============================================================================
//
// エフェクト [effect.h]
// Author : 二階堂汰一
//
//=============================================================================
#ifndef _EFFECT_H_
#define _EFFECT_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "scene2d.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 前方宣言
//*****************************************************************************

//*****************************************************************************
// 構造体定義
//*****************************************************************************

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CEffect :public CScene2d
{
public:
	CEffect(int nPriority = DEFAULT_PRIORITY);
	~CEffect();
	static HRESULT TextureLoad(void);
	static void TextureUnload(void);
	static CEffect * Create(D3DXVECTOR3 Position, D3DXVECTOR3 Size, D3DXCOLOR Color,int nLife);
	HRESULT Init(D3DXVECTOR3 Position, D3DXVECTOR3 Size, D3DXCOLOR Color, int nLife);
	void Uninit(void);
	void Update(void);
	void Draw(void);
private:
	static LPDIRECT3DTEXTURE9 m_pTexture;
	int m_nLife;
	int m_nAlpha;
	float m_fScale;
};
#endif