//=============================================================================
//
// 火球の爆発 [explosion_fireball.h]
// Author : 二階堂汰一
//
//=============================================================================
#ifndef _EXPLOSION_FIREBALL_H_
#define _EXPLOSION_FIREBALL_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "explosion.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 前方宣言
//*****************************************************************************

//*****************************************************************************
// 構造体定義
//*****************************************************************************

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CExplosionFireball :public CExplosion
{
public:
	CExplosionFireball(int nPriority = DEFAULT_PRIORITY);
	~CExplosionFireball();
	static HRESULT TextureLoad(void);
	static void TextureUnload(void);
	static CExplosionFireball * Create(D3DXVECTOR3 Position);
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);
private:
	static LPDIRECT3DTEXTURE9 m_pTexture;	//テクスチャへのポインタ
	int m_nCounterAnime;					//アニメカウンタ
	int m_nPatternAnime;					//アニメパターン
};
#endif


