//=============================================================================
//
// TCP接続受付の処理 [tcp_listener.h]
// Author : 二階堂汰一
//
//=============================================================================
#ifndef _TCPL_ISTENER_H_
#define _TCPL_ISTENER_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include <winsock2.h>

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CTcpClient;

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CTcpListener
{
public:
	CTcpListener();
	~CTcpListener();
	static CTcpListener * Create(int nPortNum);
	bool Init(int nPortNum, int nAcceptConnNum);
	CTcpClient * Accept(void);
	void Release(void);
	void Close(void);
private:
	SOCKET m_sockServer;
};

#endif
