//=============================================================================
//
// 入力処理 [input.cpp]
// Author : 二階堂汰一
//
//=============================================================================
#include "main.h"
#include "input.h"

LPDIRECTINPUT8	CInput::m_pDinput = NULL;

//=============================================================================
// コンストラクタ
//=============================================================================
CInput::CInput()
{
	m_pDevice = NULL;
}

//=============================================================================
// デストラクタ
//=============================================================================
CInput::~CInput()
{
}

//=============================================================================
// 初期化処理
//=============================================================================
HRESULT CInput::InitInput(HINSTANCE hInstance, HWND hWnd)
{
	if (FAILED(DirectInput8Create(hInstance, DIRECTINPUT_VERSION, IID_IDirectInput8, (void**)&m_pDinput, NULL)))
	{
		return E_FAIL;
	}
	return S_OK;
}

//=============================================================================
// 終了処理
//=============================================================================
void CInput::UninitInput(void)
{
	if (m_pDevice != NULL)
	{
		m_pDevice->Unacquire();
		m_pDevice->Release();
		m_pDevice = NULL;
	}
	if (m_pDinput != NULL)
	{
		m_pDinput->Release();
		m_pDinput = NULL;
	}
}
