//=============================================================================
//
// テキスト [text.h]
// Author : 二階堂汰一
//
//=============================================================================
#ifndef _TEXT_H_
#define _TEXT_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define MAX_TEXT 10
#define FONT_NAME "PixelMplus12"

//*****************************************************************************
// 構造体定義
//*****************************************************************************

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CText
{
public:
	CText();
	~CText();
	static CText *Create(D3DXVECTOR3 pos, float fSizeWidth, float fSizeHeight);
	HRESULT Init(D3DXVECTOR3 pos, float fSizeWidth, float fSizeHeight);
	void Uninit(void);
	void Update(void);
	void Draw(void);
	static void IsDrawText(bool bDraw) { m_IsDraw = bDraw; };
private:
	LPD3DXFONT				m_pFont;		// フォントへのポインタ
	RECT                    m_Rect[4];
	int                     posX;
	int                     posY;
	static char             m_str[256];
	static bool             m_IsDraw;
};
#endif // !_TEXT_H_