//=============================================================================
//
// 城 [object_castle.h]
// Author : 二階堂汰一
//
//=============================================================================
#ifndef _OBJECT_CASTLE_H_
#define _OBJECT_CASTLE_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "object.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 前方宣言
//*****************************************************************************

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CCastle :public CObject
{
public:
	CCastle();
	~CCastle();
	static HRESULT ModelLoad(void);
	static void ModelUnload(void);
	static CCastle * Create(D3DXVECTOR3 Position);
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);
private:
	static CModel::MODEL_DATA m_MeteorModelData;	//モデル情報
	static D3DXMATERIAL * m_pMaterial;				//マテリアルのポインタ
};
#endif