//=============================================================================
//
// 攻撃パターン(メテオ) [attack_pattern_meteor.h]
// Author : 二階堂汰一
//
//=============================================================================
#ifndef _ATTACK_PATTERN_METEOR_H_
#define _ATTACK_PATTERN_METEOR_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "Base/scene.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 前方宣言
//*****************************************************************************

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CAttackPatternMeteor : public CScene
{
public:
	CAttackPatternMeteor();
	~CAttackPatternMeteor();
	static CAttackPatternMeteor * Create(void);
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);
private:
	void MeteorCreate(void);
	int m_nMeteorCreateTime;		//メテオを生成する時間
	int m_nMeteorCreateCount;		//メテオの生成数
};
#endif