//=============================================================================
//
// ワームホール [wormhole.h]
// Author : 二階堂汰一
//
//=============================================================================
#ifndef _WORMHOLE_H_
#define _WORMHOLE_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "Base/scene.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 前方宣言
//*****************************************************************************

//*****************************************************************************
// 構造体定義
//*****************************************************************************

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CWormhole :public CScene
{
public:
	CWormhole(int nPriority = 2);
	~CWormhole();
	static HRESULT TextureLoad(void);
	static void TextureUnload(void);
	static CWormhole * Create(D3DXVECTOR3 Position);
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);
private:
	typedef enum
	{
		TEXTURE_NONE = -1,
		TEXTURE_WORMHOLE,
		TEXTURE_WORMHOLE_EFFECT,
		TEXTURE_MAX
	}TEXTURE;
	void Scale(void);
	void Spawn(void);
	static LPDIRECT3DTEXTURE9 m_apTexture[TEXTURE_MAX];	//テクスチャへのポインタ
	CScene2d * m_apScene2d[TEXTURE_MAX];				//シーン2Dへのポインタ
	bool m_bSpawn;										//スポーンしたか
};
#endif
