//=============================================================================
//
// オブジェクト [object.cpp]
// Author : 二階堂汰一
//
//=============================================================================

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "Base/main.h"
#include "Base/manager.h"
#include "Base/renderer.h"
#include "Mode/mode_game.h"
#include "Character/player.h"
#include "object.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 静的メンバ変数の初期化
//*****************************************************************************

//=============================================================================
// コンストラクタ
//=============================================================================
CObject::CObject()
{
	m_CollisionSize = INITIAL_D3DXVECTOR3;	//衝突判定用のサイズ
}

//=============================================================================
// デストラクタ
//=============================================================================
CObject::~CObject()
{
}

//=============================================================================
// 初期化処理関数
//=============================================================================
HRESULT CObject::Init(void)
{
	return S_OK;
}

//=============================================================================
// 終了処理関数
//=============================================================================
void CObject::Uninit(void)
{
}

//=============================================================================
// 更新処理関数
//=============================================================================
void CObject::Update(void)
{
}

//=============================================================================
// 描画処理関数
//=============================================================================
void CObject::Draw(void)
{
}

//=============================================================================
// 衝突処理関数
//=============================================================================
void CObject::Collision(void)
{
	//位置を取得する
	D3DXVECTOR3 Position = GetPosition();
	//サイズを取得する
	D3DXVECTOR3 Size = GetSize();
	//オブジェクトの衝突判定用の箱定義
	D3DXVECTOR3 ObjectBoxMax = D3DXVECTOR3(Size.x / 2, Size.y / 2, Size.z / 2) + Position;
	D3DXVECTOR3 ObjectBoxMin = D3DXVECTOR3(-Size.x / 2, -Size.y / 2, -Size.z / 2) + Position;
	//プレイヤーの取得
	CPlayer * pPlayer = CGameMode::GetPlayer();
	//もしプレイヤーのポインタがnullptrではない場合
	if (pPlayer != nullptr)
	{
		//プレイヤーの位置を取得する
		D3DXVECTOR3 PlayerPosition = pPlayer->GetPosition();
		//プレイヤーのサイズを取得する
		D3DXVECTOR3 PlayerSize = pPlayer->GetSize();
		//プレイヤーの衝突判定用の箱定義
		D3DXVECTOR3 PlayerBoxMax = D3DXVECTOR3(PlayerSize.x / 2, PlayerSize.y / 2, PlayerSize.z / 2) + PlayerPosition;
		D3DXVECTOR3 PlayerBoxMin = D3DXVECTOR3(-PlayerSize.x / 2, -PlayerSize.y / 2, -PlayerSize.z / 2) + PlayerPosition;
	}
}
