//=============================================================================
//
// スタートボタン [button_start.cpp]
// Author : 二階堂汰一
//
//=============================================================================

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include <stdio.h>
#include <stdlib.h>
#include "main.h"
#include "manager.h"
#include "renderer.h"
#include "sound.h"
#include "button_start.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 静的メンバ変数の初期化
//*****************************************************************************

//=============================================================================
// コンストラクタ
//=============================================================================
CStartButton::CStartButton()
{
}

//=============================================================================
// デストラクタ
//=============================================================================
CStartButton::~CStartButton()
{
}

//=============================================================================
// 生成処理関数呼び出し
//=============================================================================
CStartButton * CStartButton::Create(D3DXVECTOR3 Position)
{
	//スタートボタンのポインタ
	CStartButton * pStartButton = NULL;
	//スタートボタンのポインタがNULLの場合
	if (pStartButton == NULL)
	{
		//スタートボタンのメモリ確保
		pStartButton = new CStartButton;
		//スタートボタンのポインタがNULLではない場合
		if (pStartButton != NULL)
		{
			//スタートボタンの位置設定
			pStartButton->SetPosition(Position);
			//スタートボタンの初期化処理関数呼び出し
			pStartButton->Init();
		}
	}
	//スタートボタンのポインタを返す
	return pStartButton;
}

//=============================================================================
// 初期化処理関数
//=============================================================================
HRESULT CStartButton::Init(void)
{
	//ボタンの初期化処理関数呼び出し
	CButton::Init();
	return S_OK;
}

//=============================================================================
// 終了処理関数
//=============================================================================
void CStartButton::Uninit(void)
{
	//ボタンの終了処理関数呼び出し
	CButton::Uninit();
}

//=============================================================================
// 更新処理関数
//=============================================================================
void CStartButton::Update(void)
{
	//ボタンの更新処理関数呼び出し
	CButton::Update();
}

//=============================================================================
// 描画処理関数
//=============================================================================
void CStartButton::Draw(void)
{
	//ボタンの描画処理関数呼び出し
	CButton::Draw();
}

//=============================================================================
// プレス処理関数
//=============================================================================
void CStartButton::Press(void)
{
	//サウンドの取得
	CSound * pSound = CManager::GetSound();
	//もしサウンドのポインタがNULLじゃない場合
	if (pSound != NULL)
	{
		//決定音の再生
		pSound->PlaySoundA(CSound::SOUND_LABEL_SE_BUTTON_PUSH);
	}
	//ゲームモードに遷移する
	CManager::StartFade(CManager::MODE_GAME);
}
