//=============================================================================
//
// 終了ボタン [button_exit.cpp]
// Author : 二階堂汰一
//
//=============================================================================

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include <stdio.h>
#include <stdlib.h>
#include "main.h"
#include "manager.h"
#include "renderer.h"
#include "sound.h"
#include "button_exit.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 静的メンバ変数の初期化
//*****************************************************************************

//=============================================================================
// コンストラクタ
//=============================================================================
CExitButton::CExitButton()
{
}

//=============================================================================
// デストラクタ
//=============================================================================
CExitButton::~CExitButton()
{
}

//=============================================================================
// 生成処理関数呼び出し
//=============================================================================
CExitButton * CExitButton::Create(D3DXVECTOR3 Position)
{
	//終了ボタンのポインタ
	CExitButton * pExitButton = NULL;
	//終了ボタンのポインタがNULLの場合
	if (pExitButton == NULL)
	{
		//終了ボタンのメモリ確保
		pExitButton = new CExitButton;
		//終了ボタンのポインタがNULLではない場合
		if (pExitButton != NULL)
		{
			//終了ボタンの位置設定
			pExitButton->SetPosition(Position);
			//終了ボタンの初期化処理関数呼び出し
			pExitButton->Init();
		}
	}
	//終了ボタンのポインタを返す
	return pExitButton;
}

//=============================================================================
// 初期化処理関数
//=============================================================================
HRESULT CExitButton::Init(void)
{
	//ボタンの初期化処理関数呼び出し
	CButton::Init();
	return S_OK;
}

//=============================================================================
// 終了処理関数
//=============================================================================
void CExitButton::Uninit(void)
{
	//ボタンの終了処理関数呼び出し
	CButton::Uninit();
}

//=============================================================================
// 更新処理関数
//=============================================================================
void CExitButton::Update(void)
{
	//ボタンの更新処理関数呼び出し
	CButton::Update();
}

//=============================================================================
// 描画処理関数
//=============================================================================
void CExitButton::Draw(void)
{
	//ボタンの描画処理関数呼び出し
	CButton::Draw();
}

//=============================================================================
// プレス処理関数
//=============================================================================
void CExitButton::Press(void)
{
	//サウンドの取得
	CSound * pSound = CManager::GetSound();
	//もしサウンドのポインタがNULLじゃない場合
	if (pSound != NULL)
	{
		//決定音の再生
		pSound->PlaySoundA(CSound::SOUND_LABEL_SE_BUTTON_PUSH);
	}
	//終了させる
	exit(0);
}
