//=============================================================================
//
// ドラゴン [enemy_draogn.h]
// Author : 二階堂汰一
//
//=============================================================================
#ifndef _ENEMY_DRAGON_H_
#define _ENEMY_DRAGON_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "enemy.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 前方宣言
//*****************************************************************************

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CDragon : public CEnemy
{
public:
	CDragon();
	~CDragon();
	static HRESULT ModelLoad(void);
	static void ModelUnload(void);
	static CDragon * Create();
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);
private:
	void DataLoad(void);
	static CModel::MODEL_DATA m_aModelData[MAX_PARTS];		//モデルデータ
	static D3DXMATERIAL * m_pMaterial;						//マテリアルのポインタ

};
#endif
