//=============================================================================
//
// プレイヤーゲージの枠 [gaugeflame_player.cpp]
// Author : 二階堂汰一
//
//=============================================================================

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include <stdio.h>
#include <stdlib.h>
#include "main.h"
#include "manager.h"
#include "renderer.h"
#include "gaugeflame_player.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define TEXTURE_PASS ("Data/Texture")
#define SCRIPT_PASS ("Data/Script")

//*****************************************************************************
// 静的メンバ変数の初期化
//*****************************************************************************
LPDIRECT3DTEXTURE9 CGaugeFlamePlayer::m_pTexture = NULL;	//テクスチャのポインタ

//=============================================================================
// コンストラクタ
//=============================================================================
CGaugeFlamePlayer::CGaugeFlamePlayer()
{
}

//=============================================================================
// デストラクタ
//=============================================================================
CGaugeFlamePlayer::~CGaugeFlamePlayer()
{
}

//=============================================================================
// テクスチャ読み込み関数
//=============================================================================
HRESULT CGaugeFlamePlayer::TextureLoad(void)
{
	//レンダラーの取得
	CRenderer *pRenderer = CManager::GetRenderer();
	//デバイスの取得
	LPDIRECT3DDEVICE9 pDevice = pRenderer->GetDevice();
	// テクスチャの生成
	D3DXCreateTextureFromFile(pDevice,	// デバイスへのポインタ
		TEXTURE_PASS,					// ファイルの名前
		&m_pTexture);					// 読み込むメモリー
	return S_OK;
}

//=============================================================================
// テクスチャ破棄関数
//=============================================================================
void CGaugeFlamePlayer::TextureUnload(void)
{
	// テクスチャの破棄
	if (m_pTexture != NULL)
	{
		//テクスチャの破棄処理関数呼び出し
		m_pTexture->Release();
		//テクスチャをNULLにする
		m_pTexture = NULL;
	}
}

//=============================================================================
// 生成処理関数
//=============================================================================
CGaugeFlamePlayer * CGaugeFlamePlayer::Create(void)
{
	//プレイヤーゲージの枠のポインタ
	CGaugeFlamePlayer * pGaugeFlamePlayer = NULL;
	//プレイヤーゲージの枠がNULLの場合
	if (pGaugeFlamePlayer == NULL)
	{
		//プレイヤーゲージの枠のメモリ確保
		pGaugeFlamePlayer = new CGaugeFlamePlayer;
		//プレイヤーゲージの枠がNULLではない場合
		if (pGaugeFlamePlayer != NULL)
		{
			//プレイヤーゲージの枠の初期化処理関数呼び出し
			pGaugeFlamePlayer->Init();
		}
	}
	//プレイヤーゲージの枠のポインタを返す
	return pGaugeFlamePlayer;
}

//=============================================================================
// 初期化処理関数
//=============================================================================
HRESULT CGaugeFlamePlayer::Init(void)
{
	//スクリプトパスの設定
	SetScriptPass(SCRIPT_PASS);
	//ゲージフレームの初期化処理関数呼び出し
	CGaugeFlame::Init();
	return S_OK;
}

//=============================================================================
// 終了処理関数
//=============================================================================
void CGaugeFlamePlayer::Uninit(void)
{
	//ゲージフレームの終了処理関数呼び出し
	CGaugeFlame::Uninit();
}

//=============================================================================
// 更新処理関数
//=============================================================================
void CGaugeFlamePlayer::Update(void)
{
	//ゲージフレームの更新処理関数呼び出し
	CGaugeFlame::Update();
}

//=============================================================================
// 描画処理関数
//=============================================================================
void CGaugeFlamePlayer::Draw(void)
{
	//ゲージフレームの描画処理関数呼び出し
	CGaugeFlame::Draw();
}