//=============================================================================
//
// アイコン [ui_icon.h]
// Author : 二階堂汰一
//
//=============================================================================
#ifndef _UI_ICON_H_
#define _UI_ICON_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "scene2d.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 前方宣言
//*****************************************************************************

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CIcon :public CScene2d
{
public:
	CIcon();
	~CIcon();
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);
	void SetDataPass(const char * DataPass) { m_apDataPass[0] = DataPass; }
private:
	void DataLoad(void);
	typedef enum
	{
		PATTERN_NONE = -1,
		PATTERN_1,
		PATTERN_2,
		PATTERN_3,
		PATTERN_MAX
	}ICON_PATTERN;
	int m_nPatternAnime;							//パターンアニメ
	float m_fAnimationValue;						//アニメーションの値
	const char * m_apDataPass[MAX_PASS_LETTER];		//データスクリプトのパス
};
#endif