//=============================================================================
//
// オブジェクト [object.cpp]
// Author : 二階堂汰一
//
//=============================================================================

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include <stdio.h>
#include <stdlib.h>
#include "main.h"
#include "manager.h"
#include "renderer.h"
#include "object.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define INITIAL_POSITION (D3DXVECTOR3(0.0f,0.0f,0.0f))				//位置の初期値
#define INITIAL_SIZE (D3DXVECTOR3(0.0f,0.0f,0.0f))					//サイズの初期値
#define INITIAL_COLLISION_SIZE (D3DXVECTOR3(0.0f,0.0f,0.0f))		//衝突判定用サイズの初期値
#define INITIAL_ROTATION (D3DXVECTOR3(0.0f,0.0f,0.0f))				//回転の初期値
#define INITIAL_ALL_LIFE (0)										//全体の体力の初期値
#define INITIAL_LIFE (0)											//体力の初期値

//*****************************************************************************
// 静的メンバ変数の初期化
//*****************************************************************************

//=============================================================================
// コンストラクタ
//=============================================================================
CObject::CObject()
{
	m_Position = INITIAL_POSITION;				//位置
	m_Size = INITIAL_SIZE;						//サイズ
	m_CollisionSize = INITIAL_COLLISION_SIZE;	//衝突判定用サイズ
	m_Rotation = INITIAL_ROTATION;				//回転
	m_nAllLife = INITIAL_ALL_LIFE;				//全体の体力
	m_nLife = INITIAL_LIFE;						//体力
	m_pModel = NULL;							//モデルのポインタ
	m_ModelData = {};							//モデルデータ
}

//=============================================================================
// デストラクタ
//=============================================================================
CObject::~CObject()
{
}

//=============================================================================
// 初期化処理関数
//=============================================================================
HRESULT CObject::Init(void)
{
	//もしモデルのポインタがNULLの場合
	if (m_pModel == NULL)
	{
		//モデルの生成
		m_pModel = CModel::Create(m_ModelData);
	}
	//もしモデルのポインタがNULLじゃない場合
	if (m_pModel != NULL)
	{
		//モデルの初期化処理関数呼び出し
		m_pModel->Init();
		//モデルに位置を設定する
		m_pModel->SetPosition(m_Position);
		//モデルにサイズを設定する
		m_pModel->SetSize(m_Size);
		//モデルに回転を設定する
		m_pModel->SetRotation(m_Rotation);
	}
	return S_OK;
}

//=============================================================================
// 終了処理関数
//=============================================================================
void CObject::Uninit(void)
{
	//もしモデルのポインタがNULLじゃない場合
	if (m_pModel != NULL)
	{
		//モデルの終了処理関数呼び出し
		m_pModel->Uninit();
	}
	//破棄処理関数呼び出し
	Release();
}

//=============================================================================
// 更新処理関数
//=============================================================================
void CObject::Update(void)
{
	//もしモデルのポインタがNULLじゃない場合
	if (m_pModel != NULL)
	{
		//モデルの更新処理関数呼び出し
		m_pModel->Update();
	}
}

//=============================================================================
// 描画処理関数
//=============================================================================
void CObject::Draw(void)
{
	//もしモデルのポインタがNULLじゃない場合
	if (m_pModel != NULL)
	{
		//モデルの描画処理関数呼び出し
		m_pModel->Draw();
	}
}

//=============================================================================
// 体力減算処理関数
//=============================================================================
void CObject::SubLife(void)
{
}
