//=============================================================================
//
// 木造の家 [object_house.h]
// Author : 二階堂汰一
//
//=============================================================================
#ifndef _OBJECT_WOOD_HOUSE_H_
#define _OBJECT_WOOD_HOUSE_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "object.h"
#include "model.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 前方宣言
//*****************************************************************************

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CWoodHouse : public CObject
{
public:
	CWoodHouse();
	~CWoodHouse();
	static HRESULT ModelLoad(void);
	static void ModelUnload(void);
	static CWoodHouse * Create(D3DXVECTOR3 Position,D3DXVECTOR3 Rotation);
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);
private:
	static CModel::MODEL_DATA m_ModelData;		//モデルデータ
	static D3DXMATERIAL * m_pMaterial;			//マテリアルのポインタ
};
#endif