////=============================================================================
////
//// ランキング [ranking.h]
//// Author : 二階堂汰一
////
////=============================================================================
//#ifndef _RANKING_H_
//#define _RANKING_H_
//
////*****************************************************************************
//// ヘッダファイルのインクルード
////*****************************************************************************
//
////*****************************************************************************
//// マクロ定義
////*****************************************************************************
//#define MAX_RANKING 10
//#define SERVER_IP_NUM "127.0.0.1"
//#define SERVER_PORT_NUM 12345
//#define BUFFER_NUM 1024
//
////*****************************************************************************
//// 構造体定義
////*****************************************************************************
//
////*****************************************************************************
//// クラス定義
////*****************************************************************************
//class CRanking
//{
//public:
//	typedef struct
//	{
//		int nTime;
//	} Data;
//	typedef enum
//	{
//		COMMAND_TYPE_NONE = 0,
//		COMMAND_TYPE_RECEIVE,
//		COMMAND_TYPE_SEND
//	} COMMAND_TYPE;
//	CRanking();
//	~CRanking();
//	static CRanking * Create(void);
//	HRESULT Init(void);
//	void SendData(void);
//	void ReceiveData(void);
//	void SetSendData(Data SendData) { m_SendData = SendData; }
//	Data * GetReceiveData(void) { return m_aReceiveData; }
//private:
//	Data m_SendData;					//送信する情報
//	Data m_aReceiveData[MAX_RANKING];	//受信する情報
//};
//#endif