//=============================================================================
//
// スカイボックス [skybox.h]
// Author : 二階堂汰一
//
//=============================================================================
#ifndef _SKYBOX_H_
#define _SKYBOX_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "scene3d.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 前方宣言
//*****************************************************************************

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CSkyBox :public CScene3d
{
public:
	CSkyBox();
	~CSkyBox();
	static HRESULT TextureLoad(void);
	static void TextureUnload(void);
	static CSkyBox * Create(void);
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);
private:
	static LPDIRECT3DTEXTURE9 m_pTexture;				//テクスチャのポインタ
	D3DXMATRIX m_mtxWorld;								//ワールドマトリクス
	LPDIRECT3DVERTEXBUFFER9 m_pVtxBuff;					//頂点バッファのポインタ
	LPDIRECT3DINDEXBUFFER9 m_pIdxBuff;					//インデックスバッファポインタ
	D3DXVECTOR2 m_aTexture[NUM_VERTEX];					//テクスチャのUV座標
	D3DXCOLOR m_Color;									//頂点カラー
};
#endif