//=============================================================================
//
// ゲージのフレーム [ui_gauge_flame.h]
// Author : 二階堂汰一
//
//=============================================================================
#ifndef _UI_GAUGE_FLAME_H_
#define _UI_GAUGE_FLAME_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "scene2d.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 前方宣言
//*****************************************************************************

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CGaugeFlame :public CScene2d
{
public:
	CGaugeFlame();
	~CGaugeFlame();
	static HRESULT TextureLoad(void);
	static void TextureUnload(void);
	static CGaugeFlame * Create(D3DXVECTOR3 Position, D3DXVECTOR3 Size);
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);
private:
	static LPDIRECT3DTEXTURE9 m_pTexture;	//テクスチャへのポインタ
};
#endif