//=============================================================================
//
// ライフのUI [ui_life.h]
// Author : 二階堂汰一
//
//=============================================================================
#ifndef _UI_LIFE_H_
#define _UI_LIFE_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "scene.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CGauge;

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CLifeUI :public CScene
{
public:
	CLifeUI();
	~CLifeUI();
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);
	void SetMaxLife(int nMaxLife) { m_nMaxLife = nMaxLife; }
	void SetLife(int nLife) { m_nLife = nLife; }
	void SetGauge(CGauge * pGauge) { m_pGauge = pGauge; }
private:
	void DataLoad(void);
	D3DXVECTOR3 m_Position;							//位置
	D3DXVECTOR3 m_Size;								//サイズ
	D3DXCOLOR m_Color;								//色
	int m_nMaxLife;									//体力の最大値
	int m_nLife;									//体力
	const char * m_apDataPass[MAX_PASS_LETTER];		//データスクリプトのパス
	CGauge * m_pGauge;								//ゲージのポインタ
};
#endif