//=============================================================================
//
// プレイヤーのライフのUI [ui_life_player.cpp]
// Author : 二階堂汰一
//
//=============================================================================

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include <stdio.h>
#include <stdlib.h>
#include "main.h"
#include "manager.h"
#include "mode_game.h"
#include "renderer.h"
#include "ui_life_player.h"
#include "gauge.h"
#include "ui_life.h"
#include "player.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define SCRIPT_PASS ("Data/Script")

//*****************************************************************************
// 静的メンバ変数の初期化
//*****************************************************************************

//=============================================================================
// コンストラクタ
//=============================================================================
CPlayerLifeUI::CPlayerLifeUI()
{
}

//=============================================================================
// デストラクタ
//=============================================================================
CPlayerLifeUI::~CPlayerLifeUI()
{
}

//=============================================================================
// 生成処理関数
//=============================================================================
CPlayerLifeUI * CPlayerLifeUI::Create()
{
	//プレイヤーのライフのUIポインタ
	CPlayerLifeUI * pPlayerLifeUI = NULL;
	//プレイヤーのライフのUIポインタがNULLの場合
	if (pPlayerLifeUI == NULL)
	{
		//プレイヤーのライフのUIのメモリ確保
		pPlayerLifeUI = new CPlayerLifeUI;
		//プレイヤーのライフのUIのポインタがNULLではない場合
		if (pPlayerLifeUI != NULL)
		{
			//プレイヤーのライフのUIの初期化処理関数呼び出し
			pPlayerLifeUI->Init();
		}
	}
	//プレイヤーのライフのUIのポインタを返す
	return pPlayerLifeUI;
}

//=============================================================================
// 初期化処理関数
//=============================================================================
HRESULT CPlayerLifeUI::Init(void)
{
	//プレイヤーの取得
	CPlayer * pPlayer = CGameMode::GetPlayer();
	//もしプレイヤーのポインタがNULLじゃない場合
	if (pPlayer != NULL)
	{
		//プレイヤーの体力を取得
		int nLife = pPlayer->GetLife();
		//体力の最大値を設定
		SetMaxLife(nLife);
		//体力を設定
		SetLife(nLife);
	}
	//スクリプトパスを設定

	//ゲージの生成処理関数呼び出し
	SetGauge(CGauge::Create(D3DXVECTOR3(0.0f, 0.0f, 0.0f), D3DXVECTOR3(0.0f, 0.0f, 0.0f), D3DXCOLOR(1.0f, 1.0f, 1.0f, 1.0f)));
	//ライフの初期化処理関数呼び出し
	CLifeUI::Init();
	return S_OK;
}

//=============================================================================
// 終了処理関数
//=============================================================================
void CPlayerLifeUI::Uninit(void)
{
	//ライフのUIの終了処理関数呼び出し
	CLifeUI::Uninit();
}

//=============================================================================
// 更新処理関数
//=============================================================================
void CPlayerLifeUI::Update(void)
{
	//ライフのUIの更新処理関数呼び出し
	CLifeUI::Update();
	//プレイヤーの取得
	CPlayer * pPlayer = CGameMode::GetPlayer();
	//もしプレイヤーのポインタがNULLじゃない場合
	if (pPlayer != NULL)
	{
		//プレイヤーの体力を取得
		int nLife = pPlayer->GetLife();
		//体力を設定
		SetLife(nLife);
	}
}

//=============================================================================
// 描画処理関数
//=============================================================================
void CPlayerLifeUI::Draw(void)
{
	//ライフのUIの描画処理関数呼び出し
	CLifeUI::Draw();
}
