//=============================================================================
//
// 盾 [shield.h]
// Author : 二階堂汰一
//
//=============================================================================
#ifndef _WEAPON_SHIELD_H_
#define _WEAPON_SHIELD_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "weapon.h"
#include "model.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 前方宣言
//*****************************************************************************

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CShield : public CWeapon
{
public:
	CShield();
	~CShield();
	static HRESULT ModelLoad(void);
	static void ModelUnload(void);
	static CShield * Create();
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);
private:
	void DataLoad(void);
	static CModel::MODEL_DATA m_aModelData;		//モデルデータ
	static D3DXMATERIAL * m_pMaterial;			//マテリアルのポインタ
};
#endif