//=============================================================================
//
// タイトルモード [mode_title.h]
// Author : 二階堂汰一
//
//=============================================================================
#ifndef _MODE_TITLE_H_
#define _MODE_TITLE_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "Base/scene.h"
#include "2DPolygon/button.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CButton;

//*****************************************************************************
// 構造体定義
//*****************************************************************************

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CTitleMode : CScene
{
public:
	CTitleMode();
	~CTitleMode();
	static CTitleMode * Create();
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);
private:
	typedef struct
	{
		int nCount;		//ステックの遊び
		bool bTrigger;	//ステックを倒しているか
	}STICK;
	typedef struct
	{
		STICK Up;
		STICK Down;
	}INPUT_STICK;
	void SetButtonUI(void);
	void Input(void);
	void Select(void);
	void CreateAll(void);
	INPUT_STICK m_InputStick;					//スティックの入力方向
	int   m_nButtonPosition;					//選択中のボタンの位置
	CButton * m_apButton[CButton::BUTTON_MAX];	//ボタンへのポインタ
};
#endif
